{
    "productos": [
        {
            "codigo": "PROD0001",
            "nombre": "Toalla",
            "descripcion": "Toalla azul de alta calidad, diseñada para un uso personal cómodo y eficiente. Hecha de algodón suave y absorbente, ideal para secarse después de una ducha o para llevar al gimnasio o la piscina.",
            "imagen": "img/2.png",
            "categoria": "textil",
            "precio": 3.50,
            "existencias": 50
        },
        {
            "codigo": "PROD0002",
            "nombre": "Camisa",
            "descripcion": "Camisa roja de manga corta , perfecta para cualquier ocasión casual. Confeccionada con una mezcla de algodón y poliéster para mayor durabilidad y comodidad. Disponible en varias tallas y colores vibrantes.",
            "imagen": "img/3.png",
            "categoria": "textil",
            "precio": 5.00,
            "existencias": 30
        },
        {
            "codigo": "PROD0003",
            "nombre": "Pantalón de Mezclilla",
            "descripcion": "Pantalón azul de mezclilla de la marca LEVIS, diseñado para brindar un ajuste cómodo y un estilo moderno. Fabricado con denim de alta calidad, resistente al desgaste y con costuras reforzadas. Perfecto para uso diario y combinable con cualquier atuendo.",
            "imagen": "img/4.png",
            "categoria": "textil",
            "precio": 25.00,
            "existencias": 25
        },
        {
            "codigo": "PROD0005",
            "nombre": "Bufanda",
            "descripcion": "Bufanda de algodón suave y ligera, ideal para protegerse del frío sin perder el estilo. Disponible en varios colores y patrones elegantes, perfecta para complementar cualquier outfit en invierno o en noches frescas.",
            "imagen": "img/5.png",
            "categoria": "textil",
            "precio": 4.00,
            "existencias": 15
        },
        {
            "codigo": "PROD0006",
            "nombre": "Par de Calcetines",
            "descripcion": "Par de calcetines hechos de tela sintética transpirable, diseñados para proporcionar comodidad y ajuste perfecto durante todo el día. Ideales para actividades deportivas o uso diario, con refuerzo en la punta y el talón para mayor durabilidad.",
            "imagen": "img/6.png",
            "categoria": "textil",
            "precio": 2.50,
            "existencias": 100
        },
        {
            "codigo": "PROD0007",
            "nombre": "Vestido",
            "descripcion": "Vestido elegante y cómodo, confeccionado con tela ligera y transpirable. Perfecto para ocasiones especiales o eventos casuales, su diseño moderno y corte favorecedor realzan la figura. Disponible en varios colores y tallas.",
            "imagen": "img/7.png",
            "categoria": "promocional",
            "precio": 80,
            "existencias": 20
        },
        {
            "codigo": "PROD0008",
            "nombre": "Tela sintética",
            "descripcion": "Tela sintética de alta resistencia, ideal para la confección de ropa, forros o decoraciones. Suave al tacto y fácil de trabajar, ofrece una excelente durabilidad y es resistente al desgaste y a las arrugas.",
            "imagen": "img/8.png",
            "categoria": "promocional",
            "precio": 3.0,
            "existencias": 200
        },
        {
            "codigo": "PROD0009",
            "nombre": "Tela de algodón",
            "descripcion": "Tela de algodón 100% natural, transpirable y suave, perfecta para la confección de prendas de vestir y textiles para el hogar. Ideal para proyectos de costura, decoración y manualidades, garantizando comodidad y frescura.",
            "imagen": "img/9.png",
            "categoria": "promocional",
            "precio": 4.5,
            "existencias": 150
        }
    ]
}